"""
Artifact / Artefact (神器/古物)：比“Relic”的使用更普遍，是许多游戏的标准命名之一。它强调物品的强大力量和古老属性，是品类里的“万金油”。
"""

from uuid import uuid4
from pydantic import BaseModel, Field


###############################################################################################################################################
class Artifact(BaseModel):
    """物品基类"""

    name: str
    uuid: str = Field(default_factory=lambda: str(uuid4()))  # 全局唯一标识符
    description: str


###############################################################################################################################################
