"""战斗阶段/流程枚举模型定义"""

from enum import StrEnum, unique
from typing import final


###############################################################################################################################################
@final
@unique
class PhaseType(StrEnum):
    """战斗阶段"""

    DRAW = "draw"
    ARBITRATION = "arbitration"
    ROUND_END = "round_end"


###############################################################################################################################################
