"""目标类型模型定义"""

from enum import StrEnum, unique
from typing import final


###############################################################################################################################################
@final
@unique
class TargetType(StrEnum):
    """目标类型"""

    SINGLE = "single"  # 单体目标
    ALL = "all"  # 阵营锚点
    SPREAD = "spread"  # 阵营锚点 + 扩散效果


###############################################################################################################################################
