from csv import excel
from pathlib import Path
from loguru import logger
from numpy import character
from regex import D
from ..models import (
    Boot,
    ActorType,
    StageType,
    Dungeon,
    RPGCharacterProfile,
)
from pydantic import BaseModel
from typing import Optional
from ..game.tcg_game_demo_utils import (
    CAMPAIGN_SETTING,
    create_actor,
    create_stage,
    copy_stage,
    create_world_system,
)
import copy

# 添加脚本路径并导入函数
import sys
from pathlib import Path

sys.path.append(str(Path(__file__).parent.parent.parent.parent / "scripts"))
import read_excel

#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# 读表
excel_file_path = "读表测试.xlsx"
sheet_name1 = "dungeons"
sheet_name2 = "actors"
dungeon_info = read_excel.get_dungeon_info(excel_file_path, sheet_name1, 2)
actor_info = read_excel.get_actor_info(excel_file_path, sheet_name2, 0)

# if dungeon_info:
#     class DungeonInfo(BaseModel):
#         name: str = str(dungeon_info["name"])
#         character_sheet_name: str = str(dungeon_info["character_sheet_name"])
#         dungeon_name: str = str(dungeon_info["dungeon_name"])
#         stage_profile: str = str(dungeon_info["stage_profile"])
#         actor: str = str(dungeon_info["actor"])


#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
test_world_system = create_world_system(
    name="系统.世界系统",
    kick_off_message=f"""你已苏醒，准备开始冒险。请告诉我你的职能和目标。""",
    campaign_setting=CAMPAIGN_SETTING,
    world_system_profile="你是一个测试的系统。用于生成魔法",
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# TODO, 故意放大maxhp了。
actor_warrior = create_actor(
    name="角色.战士.卡恩",
    character_sheet_name="warrior",
    kick_off_message=f"""你已苏醒，准备开始冒险。告诉我你是谁？（请说出你的全名。）并告诉我你的战斗角色职能。回答简短(<100字)。""",
    rpg_character_profile=RPGCharacterProfile(base_max_hp=1000),
    type=ActorType.HERO,
    campaign_setting=CAMPAIGN_SETTING,
    actor_profile="你自幼出生在边境的小村庄，因多年与游荡的魔物作战而学会了实用的战斗技巧。你性格坚毅，却内心善良，为了保护家乡而加入王国军队。战乱平息后，你选择继续游历大陆，锻炼自身武技，同时寻找能为弱小者提供帮助的机会。",
    appearance="""身材修长结实，皮肤在战斗与日晒中泛着古铜色。常年锻炼使得他拥有敏捷而有力的体魄，眼神坚毅，带有淡淡的疲惫。平时身穿简洁而坚固的皮甲，胸口纹着家乡的象征图案；背负着一柄制式长剑，剑柄处刻有王国军团的标志。""",
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# TODO, 故意放大maxhp了。
actor_wizard = create_actor(
    name="角色.法师.奥露娜",
    character_sheet_name="wizard",
    kick_off_message=f"""你已苏醒，准备开始冒险。告诉我你是谁？（请说出你的全名。）并告诉我你的战斗角色职能。回答简短(<100字)。""",
    rpg_character_profile=RPGCharacterProfile(base_max_hp=1000),
    type=ActorType.HERO,
    campaign_setting=CAMPAIGN_SETTING,
    actor_profile="你是精灵王国里少数天赋异禀的年轻法师之一。你自小展现出对元素魔法的惊人理解力，却也因此时常被视为“古怪”的存在。对魔法知识的渴求，让你离开了精灵之森，开始独自游历。你除了想提升自己的法术造诣，也希望用力量维护世界平衡。",
    appearance="""拥有精灵特有的轻盈体态和尖尖的耳朵，浅绿色的双眼流露出灵动与好奇。身着淡雅的法袍，上面绣有象征自然与精灵文化的藤蔓花纹；披肩的银色长发随风轻舞。一柄雕刻精细的法杖常伴在她身边，镶嵌其上的宝石微微闪烁着神秘的光芒。""",
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# 故意后出手
actor_goblin = create_actor(
    name="角色.怪物.哥布林-拉格",
    character_sheet_name="goblin",
    kick_off_message="",
    rpg_character_profile=RPGCharacterProfile(base_dexterity=1),
    type=ActorType.MONSTER,
    campaign_setting=CAMPAIGN_SETTING,
    actor_profile=input(
        "敌人1背景描述: "
    ).strip(),  # "你是哥布林部落中狡黠而略有头脑的成员。与多数哥布林不同，你会主动与其他种族进行小规模交易，偶尔利用自己的狡诈为换取食物或装备做一些情报交换。这让你在部落内部既受嫉妒又被依赖。你心中对更强大的怪物势力既畏惧又渴望效忠，因此常常成为阴谋势力的耳目或先锋。",
    appearance=input(
        "敌人1外观描述: "
    ).strip(),  # """身材比普通哥布林略微高挑，瘦削却敏捷。皮肤呈暗绿色，眼睛闪着黄褐色的光，透出无时无刻的警惕。鼻子小而上翘，双耳显得尖长。破旧的皮质护肩上挂着几颗用来炫耀战绩的兽牙，腰间除了短刃还挂着一个小皮囊，内里装着经常使用的毒粉或烟雾弹。""",
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# 故意后出手
actor_orcs = create_actor(
    name="角色.怪物.兽人-库洛斯",
    character_sheet_name="orc",
    kick_off_message="",
    rpg_character_profile=RPGCharacterProfile(base_dexterity=1),
    type=ActorType.MONSTER,
    campaign_setting=CAMPAIGN_SETTING,
    actor_profile="""你是兽人部族中的一员，出生于荒野之地。你从小就展现出强大的战斗力，长大后夺取了自己的小型战团，带领部下四处征战与掠夺。在追求力量与战利品的道路上，你逐渐形成了狂热的好战性格，但也懂得利用最基本的谋略来维持在族群中的统治地位。""",
    appearance="""身材高大如巨人，肌肉紧绷，皮肤是深灰色的粗糙质感。额头上有一道丑陋的旧伤，横贯双眉，展现了他早年的激烈战斗痕迹。獠牙突出，双目中燃烧着好战的欲望。常穿着由兽皮和金属碎片拼接而成的胸甲，肩上披着大型凶兽的毛皮。背后则挂着一柄巨大的战斧，上面沾染着深沉的铁锈与干涸的血迹。""",
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# 故意后出手
actor_spider = create_actor(
    name="角色.怪物.蜘蛛-小红",
    character_sheet_name="spider",
    kick_off_message="",
    rpg_character_profile=RPGCharacterProfile(base_dexterity=1),
    type=ActorType.MONSTER,
    campaign_setting=CAMPAIGN_SETTING,
    actor_profile="""你是一只小型的蜘蛛，生活在干燥的洞窟中。你擅长织造精美的蛛网，捕捉小型猎物为生。虽然体型不大，但你拥有敏捷的身手和剧毒的牙齿，能够轻易制服比你大的敌人。你对洞穴中的环境非常熟悉，能在黑暗中自如行动。""",
    appearance="""身材娇小，身体呈现出淡黄色的色调，四肢纤细而灵活。八只眼睛闪烁着微弱的光芒，能够在黑暗中看清一切。背部有着精致的蛛网纹理，腹部则有一对小巧的毒腺，随时准备释放剧毒。整体外观给人一种既美丽又危险的感觉。""",
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
stage_heros_camp = create_stage(
    name="场景.营地",
    character_sheet_name="camp",
    kick_off_message="营火静静地燃烧着。据消息附近的洞窟里出现了怪物，需要冒险者前去调查。",
    campaign_setting=CAMPAIGN_SETTING,
    type=StageType.HOME,
    stage_profile="你是一个冒险者的临时营地，四周是一片未开发的原野。营地中有帐篷，营火，仓库等设施，虽然简陋，却也足够让人稍事休息，准备下一次冒险。",
    actors=[],
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# 创建实例：洞穴1
stage_dungeon_cave1 = create_stage(
    name="场景.洞窟之一",
    character_sheet_name="goblin_cave",
    kick_off_message="",
    campaign_setting=CAMPAIGN_SETTING,
    type=StageType.DUNGEON,
    stage_profile=input("洞窟场景描述: ").strip()
    or "你是一个阴暗潮湿的洞窟，四周布满了苔藓和石笋。洞内有哥布林的营地，地上散落着破旧的武器和食物残渣。洞穴深处传来低语声和偶尔的金属碰撞声，似乎有哥布林在进行某种活动。",
    actors=[],
)
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
stage_dungeon_cave2 = copy_stage(
    name="场景.洞窟之二",
    stage_character_sheet=stage_dungeon_cave1.character_sheet,
    kick_off_message="",
    campaign_setting=CAMPAIGN_SETTING,
    actors=[],
)

#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
if dungeon_info:
    stage_dungeon_cave3 = create_stage(
        name=str(dungeon_info["name"]),
        character_sheet_name=str(dungeon_info["character_sheet_name"]),
        kick_off_message="",
        campaign_setting=CAMPAIGN_SETTING,
        type=StageType.DUNGEON,
        stage_profile=str(dungeon_info["stage_profile"]),
        actors=[],
    )
#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
# 添加一些人物关系做润色。
actor_warrior.kick_off_message += f"""\n注意:{actor_wizard.name} 是你的同伴。你目前只会使用防御类的技能！你讨厌黑暗法术，因为你认为它们是邪恶的。"""
actor_wizard.kick_off_message += f"""\n注意:{actor_warrior.name} 是你的同伴。你最擅长的是火焰类的魔法，而且你还有一个不为别人知道的秘密：你深刻理解黑暗元素的力量，但是不会轻易使用它，如果面对你最讨厌的东西——哥布林的时候你会毫不犹豫运用这种禁忌之力将其清除。"""

# 改变一些数据，例如将角色放入场景 !!!!!!!!!
# 测试直接打死。
actor_goblin.rpg_character_profile.hp = 1
actor_orcs.rpg_character_profile.hp = 1
actor_spider.rpg_character_profile.hp = 1
# 创建世界
world_boot = Boot(name="", campaign_setting=CAMPAIGN_SETTING)

# 营地中放置角色，这里是战士和法师。
stage_heros_camp.actors = [actor_warrior, actor_wizard]

# 第一个洞穴，放置哥布林。
stage_dungeon_cave1.actors = [actor_goblin]

# 第二个洞穴，放置兽人。
stage_dungeon_cave2.actors = [actor_orcs]

# 第三个洞穴，放置蜘蛛。
stage_dungeon_cave3.actors = [actor_spider]

world_boot.stages = [
    stage_heros_camp,
]

world_boot.world_systems = []


#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
def setup_demo_game_world(game_name: str, write_path: Path) -> Optional[Boot]:

    try:

        global world_boot

        create_new_world = copy.deepcopy(world_boot)
        create_new_world.name = game_name

        # 写入文件
        write_path.write_text(create_new_world.model_dump_json(), encoding="utf-8")

        # 返回
        return create_new_world

    except Exception as e:
        logger.error(f"An error occurred: {e}")
        # return None

    # assert False, "Should not reach here"
    return None


#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
def create_demo_dungeon2() -> Dungeon:
    return Dungeon(
        name="哥布林与兽人",
        levels=[
            stage_dungeon_cave1,
            stage_dungeon_cave2,
        ],
    )


#######################################################################################################################################
def create_demo_dungeon1() -> Dungeon:
    return Dungeon(
        name="兽人巢穴",
        levels=[
            stage_dungeon_cave2,
        ],
    )


#######################################################################################################################################
def create_demo_dungeon3() -> Dungeon:
    return Dungeon(
        name="蜘蛛洞穴",
        levels=[
            stage_dungeon_cave3,
        ],
    )


#######################################################################################################################################
#######################################################################################################################################
#######################################################################################################################################
