from enum import StrEnum, unique
from my_components.action_components import StageNarrateAction, SkillAction
from typing import List
from extended_systems.prop_file import PropFile


################################################################################################################################################
@unique
class PromptTag(StrEnum):

    CURRENT_ROUND_TAG = "<当前回合数>"

    ACTOR_PLAN_PROMPT_TAG = "<角色计划>"

    STAGE_PLAN_PROMPT_TAG = "<场景计划>"

    STAGE_ENTRY_TAG = "场景进入限制"

    STAGE_EXIT_TAG = "场景离开限制"


################################################################################################################################################
@unique
class SkillResultPromptTag(StrEnum):
    SUCCESS = "<成功>"
    CRITICAL_SUCCESS = "<大成功>"
    FAILURE = "<失败>"


################################################################################################################################################
def replace_you(input_text: str, your_name: str) -> str:
    if len(input_text) == 0 or your_name not in input_text:
        return input_text
    return input_text.replace(your_name, "你")


################################################################################################################################################
def insert_stage_narrate_action_prompt() -> str:
    return f"""## 注意！{StageNarrateAction.__name__} —— 场景描述 生成规则
请注意回顾 输出格式指南 的 {StageNarrateAction.__name__} 的 键值对的格式：
### 步骤
1. 事件回顾：回顾场景内已发生的角色行为、对话及道具使用，判断这些事件对场景状态的具体影响。场景会根据自身设定进行逻辑性变化，例如自然发展的状态变化（如火焰蔓延）。切勿推测未发生的活动。
2. 状态更新与描述：结合事件回顾和场景设定，推理并更新场景的最新状态。生成的场景描述应着重展示环境背景及关键细节，如光线、气味和音效。
3. 角色信息排除：移除描述中的所有角色相关信息，仅呈现场景本身的完整细节。
### 注意事项
- 输出必须清晰反映场景的当前状态及变化，不应包含角色行为或心理描写。
- 描述应有层次感，确保在确保‘角色信息排除’的基础上，场景状态更新全面而无遗漏。"""


################################################################################################################################################
def skill_action_rule_prompt() -> str:
    return f"""## 关于动作: {SkillAction.__name__} —— 技能使用指令 生成规则
请注意回顾 输出格式指南 的 {SkillAction.__name__} 的 键值对的格式：
注意！请严格遵循以下格式书写，否则系统将无法识别：
格式示例：@目标角色(全名) /技能道具(全名) /配置道具(全名)=消耗数量 /配置道具(全名)=消耗数量 ...
解释与规则：
- 指令含义：表示你经过思考后，准备对目标使用技能，并选择配置道具及其消耗数量以实现目标。
- 技能道具：只能选择一个。
- 配置道具：可以选择多个。
- 消耗数量：如使用配置道具，消耗数量必须至少为1(即填写 /配置道具(全名)=1)
- 目标选择：必须根据技能描述选择至少一个目标角色。
- 配置道具选择：可以根据技能描述选择配置道具，也可以不选择。"""


################################################################################################################################################
def insert_skill_action_prompt(props: List[PropFile]) -> str:
    if len(props) == 0:
        return ""
    assert all([prop.is_skill for prop in props]), "不是技能文件"
    return skill_action_rule_prompt()


################################################################################################################################################
